SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_modem.h
/* Bit fields for MODEM ETSTIM */
#define _MODEM_ETSTIM_RESETVALUE                             0x00000000UL                               /**< Default value for MODEM_ETSTIM              */
#define _MODEM_ETSTIM_MASK                                   0x0003FFFFUL                               /**< Mask for MODEM_ETSTIM                       */
#define _MODEM_ETSTIM_ETSTIMVAL_SHIFT                        0                                          /**< Shift value for MODEM_ETSTIMVAL             */
#define _MODEM_ETSTIM_ETSTIMVAL_MASK                         0x1FFFFUL                                  /**< Bit mask for MODEM_ETSTIMVAL                */
#define _MODEM_ETSTIM_ETSTIMVAL_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_ETSTIM               */
#define MODEM_ETSTIM_ETSTIMVAL_DEFAULT                       (_MODEM_ETSTIM_ETSTIMVAL_DEFAULT << 0)     /**< Shifted mode DEFAULT for MODEM_ETSTIM       */
#define MODEM_ETSTIM_ETSCOUNTEREN                            (0x1UL << 17)                              /**< ETSCOUNTEREN                                */
#define _MODEM_ETSTIM_ETSCOUNTEREN_SHIFT                     17                                         /**< Shift value for MODEM_ETSCOUNTEREN          */
#define _MODEM_ETSTIM_ETSCOUNTEREN_MASK                      0x20000UL                                  /**< Bit mask for MODEM_ETSCOUNTEREN             */
#define _MODEM_ETSTIM_ETSCOUNTEREN_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for MODEM_ETSTIM               */
#define MODEM_ETSTIM_ETSCOUNTEREN_DEFAULT                    (_MODEM_ETSTIM_ETSCOUNTEREN_DEFAULT << 17) /**< Shifted mode DEFAULT for MODEM_ETSTIM       */

/* Bit fields for MODEM ANTSWCTRL1 */
#define _MODEM_ANTSWCTRL1_RESETVALUE                         0x0006AAAAUL                                /**< Default value for MODEM_ANTSWCTRL1          */
#define _MODEM_ANTSWCTRL1_MASK                               0x00FFFFFFUL                                /**< Mask for MODEM_ANTSWCTRL1                   */
#define _MODEM_ANTSWCTRL1_TIMEPERIOD_SHIFT                   0                                           /**< Shift value for MODEM_TIMEPERIOD            */
#define _MODEM_ANTSWCTRL1_TIMEPERIOD_MASK                    0xFFFFFFUL                                  /**< Bit mask for MODEM_TIMEPERIOD               */
#define _MODEM_ANTSWCTRL1_TIMEPERIOD_DEFAULT                 0x0006AAAAUL                                /**< Mode DEFAULT for MODEM_ANTSWCTRL1           */
#define MODEM_ANTSWCTRL1_TIMEPERIOD_DEFAULT                  (_MODEM_ANTSWCTRL1_TIMEPERIOD_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ANTSWCTRL1   */

/* Bit fields for MODEM COCURRMODE */
#define _MODEM_COCURRMODE_RESETVALUE                         0x00000000UL                                 /**< Default value for MODEM_COCURRMODE          */
#define _MODEM_COCURRMODE_MASK                               0x80000000UL                                 /**< Mask for MODEM_COCURRMODE                   */
#define MODEM_COCURRMODE_CONCURRENT                          (0x1UL << 31)                                /**< CONCURRENT MODE Enable                      */
#define _MODEM_COCURRMODE_CONCURRENT_SHIFT                   31                                           /**< Shift value for MODEM_CONCURRENT            */
#define _MODEM_COCURRMODE_CONCURRENT_MASK                    0x80000000UL                                 /**< Bit mask for MODEM_CONCURRENT               */
#define _MODEM_COCURRMODE_CONCURRENT_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MODEM_COCURRMODE           */
#define MODEM_COCURRMODE_CONCURRENT_DEFAULT                  (_MODEM_COCURRMODE_CONCURRENT_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_COCURRMODE   */

/* Bit fields for MODEM ANTDIVCTRL */
#define _MODEM_ANTDIVCTRL_RESETVALUE                         0x00000000UL                                   /**< Default value for MODEM_ANTDIVCTRL          */
#define _MODEM_ANTDIVCTRL_MASK                               0x000001FFUL                                   /**< Mask for MODEM_ANTDIVCTRL                   */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_SHIFT                  0                                              /**< Shift value for MODEM_ADPRETHRESH           */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_MASK                   0xFFUL                                         /**< Bit mask for MODEM_ADPRETHRESH              */
#define _MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT                 (_MODEM_ANTDIVCTRL_ADPRETHRESH_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH                       (0x1UL << 8)                                   /**< Enable Preamble threshold                   */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_SHIFT                8                                              /**< Shift value for MODEM_ENADPRETHRESH         */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_MASK                 0x100UL                                        /**< Bit mask for MODEM_ENADPRETHRESH            */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for MODEM_ANTDIVCTRL           */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE              0x00000000UL                                   /**< Mode DISABLE for MODEM_ANTDIVCTRL           */
#define _MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE               0x00000001UL                                   /**< Mode ENABLE for MODEM_ANTDIVCTRL            */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT               (_MODEM_ANTDIVCTRL_ENADPRETHRESH_DEFAULT << 8) /**< Shifted mode DEFAULT for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE               (_MODEM_ANTDIVCTRL_ENADPRETHRESH_DISABLE << 8) /**< Shifted mode DISABLE for MODEM_ANTDIVCTRL   */
#define MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE                (_MODEM_ANTDIVCTRL_ENADPRETHRESH_ENABLE << 8)  /**< Shifted mode ENABLE for MODEM_ANTDIVCTRL    */

/* Bit fields for MODEM BLEIQDSAEXT2 */
#define _MODEM_BLEIQDSAEXT2_RESETVALUE                       0x00000000UL                                           /**< Default value for MODEM_BLEIQDSAEXT2        */
#define _MODEM_BLEIQDSAEXT2_MASK                             0x000007FFUL                                           /**< Mask for MODEM_BLEIQDSAEXT2                 */
#define MODEM_BLEIQDSAEXT2_DISMAXPEAKTRACKMODE               (0x1UL << 0)                                           /**< Disable Max Peak Track Mode                 */
#define _MODEM_BLEIQDSAEXT2_DISMAXPEAKTRACKMODE_SHIFT        0                                                      /**< Shift value for MODEM_DISMAXPEAKTRACKMODE   */
#define _MODEM_BLEIQDSAEXT2_DISMAXPEAKTRACKMODE_MASK         0x1UL                                                  /**< Bit mask for MODEM_DISMAXPEAKTRACKMODE      */
#define _MODEM_BLEIQDSAEXT2_DISMAXPEAKTRACKMODE_DEFAULT      0x00000000UL                                           /**< Mode DEFAULT for MODEM_BLEIQDSAEXT2         */
#define MODEM_BLEIQDSAEXT2_DISMAXPEAKTRACKMODE_DEFAULT       (_MODEM_BLEIQDSAEXT2_DISMAXPEAKTRACKMODE_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT2 */
#define _MODEM_BLEIQDSAEXT2_BBSSDEBOUNCETIM_SHIFT            1                                                      /**< Shift value for MODEM_BBSSDEBOUNCETIM       */
#define _MODEM_BLEIQDSAEXT2_BBSSDEBOUNCETIM_MASK             0x1FEUL                                                /**< Bit mask for MODEM_BBSSDEBOUNCETIM          */
#define _MODEM_BLEIQDSAEXT2_BBSSDEBOUNCETIM_DEFAULT          0x00000000UL                                           /**< Mode DEFAULT for MODEM_BLEIQDSAEXT2         */
#define MODEM_BLEIQDSAEXT2_BBSSDEBOUNCETIM_DEFAULT           (_MODEM_BLEIQDSAEXT2_BBSSDEBOUNCETIM_DEFAULT << 1)     /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT2 */
#define _MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_SHIFT              9                                                      /**< Shift value for MODEM_BBSSDIFFCHVAL         */
#define _MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_MASK               0x600UL                                                /**< Bit mask for MODEM_BBSSDIFFCHVAL            */
#define _MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_DEFAULT            0x00000000UL                                           /**< Mode DEFAULT for MODEM_BLEIQDSAEXT2         */
#define _MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT0                0x00000000UL                                           /**< Mode GT0 for MODEM_BLEIQDSAEXT2             */
#define _MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT1                0x00000001UL                                           /**< Mode GT1 for MODEM_BLEIQDSAEXT2             */
#define _MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT2                0x00000002UL                                           /**< Mode GT2 for MODEM_BLEIQDSAEXT2             */
#define _MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT3                0x00000003UL                                           /**< Mode GT3 for MODEM_BLEIQDSAEXT2             */
#define MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_DEFAULT             (_MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_DEFAULT << 9)       /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT2 */
#define MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT0                 (_MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT0 << 9)           /**< Shifted mode GT0 for MODEM_BLEIQDSAEXT2     */
#define MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT1                 (_MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT1 << 9)           /**< Shifted mode GT1 for MODEM_BLEIQDSAEXT2     */
#define MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT2                 (_MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT2 << 9)           /**< Shifted mode GT2 for MODEM_BLEIQDSAEXT2     */
#define MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT3                 (_MODEM_BLEIQDSAEXT2_BBSSDIFFCHVAL_GT3 << 9)           /**< Shifted mode GT3 for MODEM_BLEIQDSAEXT2     */

/* Bit fields for MODEM SPARE */
#define _MODEM_SPARE_RESETVALUE                              0x00000000UL                      /**< Default value for MODEM_SPARE               */
#define _MODEM_SPARE_MASK                                    0x000000FFUL                      /**< Mask for MODEM_SPARE                        */
#define _MODEM_SPARE_SPARE_SHIFT                             0                                 /**< Shift value for MODEM_SPARE                 */
#define _MODEM_SPARE_SPARE_MASK                              0xFFUL                            /**< Bit mask for MODEM_SPARE                    */
#define _MODEM_SPARE_SPARE_DEFAULT                           0x00000000UL                      /**< Mode DEFAULT for MODEM_SPARE                */
#define MODEM_SPARE_SPARE_DEFAULT                            (_MODEM_SPARE_SPARE_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_SPARE        */

/* Bit fields for MODEM IRCALCOEFWR */
#define _MODEM_IRCALCOEFWR_RESETVALUE                        0x00000000UL                              /**< Default value for MODEM_IRCALCOEFWR         */
#define _MODEM_IRCALCOEFWR_MASK                              0xFFFFFFFFUL                              /**< Mask for MODEM_IRCALCOEFWR                  */
#define _MODEM_IRCALCOEFWR_CRVWD_SHIFT                       0                                         /**< Shift value for MODEM_CRVWD                 */
#define _MODEM_IRCALCOEFWR_CRVWD_MASK                        0x7FFFUL                                  /**< Bit mask for MODEM_CRVWD                    */
#define _MODEM_IRCALCOEFWR_CRVWD_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CRVWD_DEFAULT                      (_MODEM_IRCALCOEFWR_CRVWD_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */
#define MODEM_IRCALCOEFWR_CRVWEN                             (0x1UL << 15)                             /**< CIV Coefficient Write Enable                */
#define _MODEM_IRCALCOEFWR_CRVWEN_SHIFT                      15                                        /**< Shift value for MODEM_CRVWEN                */
#define _MODEM_IRCALCOEFWR_CRVWEN_MASK                       0x8000UL                                  /**< Bit mask for MODEM_CRVWEN                   */
#define _MODEM_IRCALCOEFWR_CRVWEN_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CRVWEN_DEFAULT                     (_MODEM_IRCALCOEFWR_CRVWEN_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */
#define _MODEM_IRCALCOEFWR_CIVWD_SHIFT                       16                                        /**< Shift value for MODEM_CIVWD                 */
#define _MODEM_IRCALCOEFWR_CIVWD_MASK                        0x7FFF0000UL                              /**< Bit mask for MODEM_CIVWD                    */
#define _MODEM_IRCALCOEFWR_CIVWD_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CIVWD_DEFAULT                      (_MODEM_IRCALCOEFWR_CIVWD_DEFAULT << 16)  /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */
#define MODEM_IRCALCOEFWR_CIVWEN                             (0x1UL << 31)                             /**< CIV Coefficient Write Enable                */
#define _MODEM_IRCALCOEFWR_CIVWEN_SHIFT                      31                                        /**< Shift value for MODEM_CIVWEN                */
#define _MODEM_IRCALCOEFWR_CIVWEN_MASK                       0x80000000UL                              /**< Bit mask for MODEM_CIVWEN                   */
#define _MODEM_IRCALCOEFWR_CIVWEN_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CIVWEN_DEFAULT                     (_MODEM_IRCALCOEFWR_CIVWEN_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */

/** @} End of group MGM22_MODEM_BitFields */
/** @} End of group MGM22_MODEM */
/** @} End of group Parts */

#endif /* MGM22_MODEM_H */
